#+TITLE: Structure and Interpretation of Clojure Transducers
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+OPTIONS: toc:nil num:nil

*** Accumulate a number

#+begin_src clojure :session s :results pp :exports both
  (-reduce + 0 [1 2 3 4])
#+end_src

#+RESULTS:
: 10

*** Accumulate a collection

#+begin_src clojure :session s :results pp :exports both
  (-reduce conj [] [1 2 3 4])
#+end_src

#+RESULTS:
: [1 2 3 4]

*** Accumulate a collection of different type

#+begin_src clojure :session s :results pp :exports both
  (-reduce conj () [1 2 3 4])
#+end_src

#+RESULTS:
: (4 3 2 1)

*** loop implementation

#+begin_src clojure :session s :results pp :exports both
  (defn -map
    [f coll]
    (loop [ret []]
      (if (seq coll)
        (let [[head & tail] coll]
          (recur
           (conj ret (f head))
           tail))
        ret)))
  
  (-map inc [1 2 3 4])
#+end_src

#+RESULTS:
: [2 3 4 5]

*** reduce conversion

Since loop and reduce are equivalent, we can rewrite our map with reduce:

#+begin_src clojure :session s :results pp :exports both
  (defn -map
    ([f coll]
     (-map f [] coll))
    ([f init coll]
     (-reduce
      (fn [accumulator element]
        (conj accumulator (f element)))
      init
      coll)))

  (-map inc [1 2 3 4])
#+end_src

#+RESULTS:
: [2 3 4 5]

*** loop implementation

#+begin_src clojure :session s :results pp :exports both
  (defn -filter
    [pred coll]
    (loop [ret []
           coll (seq coll)]
      (if coll
        (let [[head & tail] coll
              accum (if (pred head) (conj ret head) ret)]
          (recur accum
           tail))
        ret)))

  (-filter even? [1 2 3 4])
#+end_src

#+RESULTS:
: [2 4]

*** reduce conversion

#+begin_src clojure :session s :results pp :exports both
  (defn -filter
    ([pred coll]
     (-filter pred [] coll))
    ([pred init coll]
     (-reduce
      (fn [accumulator element]
        (if (pred element)
          (conj accumulator element)
          accumulator))
      init
      coll)))
  
  (-filter even? [1 2 3 4])
#+end_src

#+RESULTS:
: [2 4]


** Map's core

#+begin_src clojure :session s :results pp :exports both
  (defn map-core
    [f]
    (fn [accumulator element]
      (conj accumulator (f element))))

  (defn -map
    ([f coll]
     (-map f [] coll))
    ([f init coll]
     (-reduce (map-core f) init coll)))

  (-map inc [1 2 3 4])
#+end_src

#+RESULTS:
: [2 3 4 5]

** Filter's core

#+begin_src clojure :session s :results pp :exports both
  (defn filter-core
    [pred]
    (fn [accumulator element]
      (if (pred element)
        (conj accumulator element)
        accumulator)))

  (defn -filter
    ([pred coll]
     (-filter pred [] coll))
    ([pred init coll]
     (-reduce (filter-core pred) init coll)))
  
  (-filter even? [1 2 3 4])
#+end_src

#+RESULTS:
: [2 4]


*** Map

#+begin_src clojure :session s :results pp :exports both
  (defn map-core
    [f grow]
    (fn [accumulator element]
      (grow accumulator (f element))))

  (defn -map
    ([f coll]
     (-map f [] coll))
    ([f init coll]
     (-reduce (map-core f conj) init coll)))
  
  (-map inc [1 2 3 4])
#+end_src

#+RESULTS:
: [2 3 4 5]

*** Map, curried

But that's actually a less interesting way of writing it. We can instead return
a closure:

#+begin_src clojure :session s :results pp :exports both
  (defn map-core
    [f]
    (fn [grow]
      (fn [accumulator element]
        (grow accumulator (f element)))))

  (defn -map
    ([f coll]
     (-map f [] coll))
    ([f init coll]
     (-reduce ((map-core f) conj) init coll)))

  (-map inc [1 2 3 4])
#+end_src

#+RESULTS:
: [2 3 4 5]

*** Filter, curried

Similarly for filter:

#+begin_src clojure :session s :results pp :exports both
  (defn filter-core
    [pred]
    (fn [grow]
      (fn [accumulator element]
        (if (pred element)
          (grow accumulator element)
          accumulator))))

  (defn -filter
    ([pred coll]
     (-filter pred [] coll))
    ([pred init coll]
     (-reduce ((filter-core pred) conj) init coll)))

  (-filter even? [1 2 3 4])
#+end_src

#+RESULTS:
: [2 4]

#+REVEAL: split:t

"Okay", you might say, "this is interesting". But is it useful?

*** For example

#+begin_src clojure :session s :results pp :exports both
  (defn rf
    ([] (transient []))
    ([v] (persistent! v))
    ([v x] (conj! v x)))

  (defn map-core
    [f]
    (fn [rf]
      (fn [accumulator element]
        (rf accumulator (f element)))))

  (defn -map
    ([f coll]
     (-map f (rf) coll))
    ([f init coll]
     (rf (-reduce ((map-core f) rf) init coll))))

  (-map inc [1 2 3 4 5 6 7 8])
#+end_src

#+RESULTS:
: [2 3 4 5 6 7 8 9]

** A wild transduce appears

Now the process almost jumps out at us:

#+begin_src clojure :session s :results pp :exports both
  (defn -transduce
    ([rf ?f coll]
     (-transduce rf ?f (rf) coll))
    ([rf ?f init coll]
     (let [rf' (?f rf)
           ret (-reduce rf' init coll)]
       (rf ret))))

  (defn -map
    [f coll]
    (-transduce rf (map-core f) coll))

  (-map inc [1 2 3 4 5 6 7 8])
#+end_src

#+RESULTS:
: [2 3 4 5 6 7 8 9]

*** Volatile

A little helper, because we'll want the previous value:

#+begin_src clojure :session s :results pp :exports both
  (defmacro vswap-val!
    "Like vswap! but returns the old value."
    [v & args]
    `(let [old# @~v]
       (vswap! ~v ~@args)
       old#))
#+end_src

#+REVEAL: split:t

#+begin_src clojure :session s :results pp :exports both
  (defn -map-indexd
    [f]
    (fn [rf]
      (let [i (volatile! 0)]
        (fn
          ([] (rf))
          ([acc] (rf acc))
          ([acc x]
           (rf acc (f (vswap-val! i inc) x)))))))

  (sequence (-map-indexd vector) [:a :b :c])
#+end_src

#+RESULTS:
: ([0 :a] [1 :b] [2 :c])

*** Custom type

Mutable counter, implements ~invoke~, which mutates the member ~i~

#+begin_src clojure :session s :results pp :exports both
  (deftype Counter [^int ^:unsynchronized-mutable i]
    clojure.lang.IFn
    (invoke [_]
      (let [i' i]
        (set! i (unchecked-inc-int i))
        i')))

  (def c (Counter. 0))
  (.i c) ;; => 0
  (c) ;; => 0 returns previous value, increments counter
  (.i c) ;; => 1
#+end_src

#+REVEAL: split:t

#+begin_src clojure :session s :results pp :exports both
  (defn -map-indexd
    [f]
    (fn [rf]
      (let [i (Counter. 0)]
        (fn
          ([] (rf))
          ([acc] (rf acc))
          ([acc x]
           (rf acc (f (i) x)))))))

  (sequence (-map-indexd vector) [:a :b :c])
#+end_src

#+RESULTS:
: ([0 :a] [1 :b] [2 :c])

** Sliding window

Other types of state can also be maintained.

For example, holding references to multiple elements, which lets us
implement operations like windowing.

Let's reach for a Queue implementation which has the methods add,
remove, size

#+REVEAL: split:t

#+begin_src clojure :session s :results pp :exports both
  (defn sliding
    ([^long n]
     (sliding n 1))
    ([^long n ^long step]
     (fn [rf]
       (let [a (java.util.ArrayDeque. n)] ;; Queue here
         (fn
           ([] (rf))
           ([result] (rf result)) ;; don't need leftovers
           ([result input]
            (.add a input)
            (if (= n (.size a))
              (let [v (vec (.toArray a))] ;; toArray copies the collection
                ;; Remove `step` elements
                (dotimes [_ step] (.removeFirst a))
                (rf result v))
              result)))))))

  (sequence (sliding 3) (range 10))
#+end_src

#+RESULTS:
: ([0 1 2] [1 2 3] [2 3 4] [3 4 5] [4 5 6] [5 6 7] [6 7 8] [7 8 9])


** Eduction

The peek of laziness is not doing anything at all.

As opposed to ~sequence~ which returns a lazy sequence, an ~Eduction~ is
a promise of a reduction. It implements the reduce interface but doesn't
/do/ anything until you reduce over it.

Returns a reducible/iterable application of the transducer to the items
in coll. these applications will be performed every time reduce/iterator
is called.

#+REVEAL: split:t

Pros: They compose arbitrarily with very little overhead

Cons: Results are not cached, be careful not to reduce over an eduction
twice, unless you want to.

Lets set up a hypothetical example of plenty of nested sequences (they
happen)

#+REVEAL: split:t

#+begin_src clojure :session s
  (def xs [[1 2 3] [4 5 6] [7 8 9]])
  (def ys '[[a b c] [x y z] [u v w]])
  (def zs (mapv (partial mapv keyword) '[[a b c] [x y z] [u v w]]))
#+end_src

#+REVEAL: split:t

Had we wanted to concat them all, we might have written something like:

#+begin_src clojure :session s :results pp :exports both
  (concat
   (apply concat xs)
   (apply concat ys)
   (apply concat zs))
#+end_src

#+RESULTS:
: (1 2 3 4 5 6 7 8 9 a b c x y z u v w :a :b :c :x :y :z :u :v :w)

*** ~cat~ vs. ~concat~

~cat~ is the transducing version of ~concat~.

Where we'd write
#+begin_src clojure
(concat [1 2 3] [4 5 6]) ;; => (1 2 3 4 5 6)
#+end_src

We can write
#+begin_src clojure
(sequence cat [[1 2 3] [4 5 6]]) ;; => (1 2 3 4 5 6)
(->Eduction cat [[1 2 3] [4 5 6]]) ;; => (1 2 3 4 5 6)
#+end_src

Notice the need to pack the sequences in a wrapping sequence.

On the other hand, no more need to write ~(apply concat ,,,)~

#+REVEAL: split:t

With eduction:

#+begin_src clojure :session s :results pp :exports both
  (defn caduction [xs] (->Eduction cat xs))

  (caduction
   [(caduction xs)
    (caduction ys)
    (caduction zs)])
#+end_src

#+RESULTS:
: (1 2 3 4 5 6 7 8 9 a b c x y z u v w :a :b :c :x :y :z :u :v :w)

#+REVEAL: split:t

There are certainly performance benefits:

#+begin_src clojure :session s
  (time
   (dotimes [_ 1e6]
     (count
      (concat
       (apply concat xs)
       (apply concat ys)
       (apply concat zs)))))

  "Elapsed time: 2214.169337 msecs"
#+end_src

#+REVEAL: split:t

#+begin_src clojure :session s
  (def incr (fn [^long x _] (unchecked-inc x)))
  (defn -count
    [xs]
    (reduce incr 0 xs))

  (time
   (dotimes [_ 1e6]
     (-count
      (caduction
       [(caduction xs)
        (caduction ys)
        (caduction zs)]))))
  "Elapsed time: 402.897992 msecs"
#+end_src

